Revit 2026 API

# TemporaryViewModesCustomColor Property

---

Custom color for the TemporaryViewProperties mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color CustomColor { get; set; }
```
```vb
Public Property CustomColor As Color
	Get
	Set
```
```cpp
public:
property Color^ CustomColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member CustomColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

If custom title is not empty, Temporary View Properties mode displays the colored view frame in custom color.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace